In [7]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [8]:
serr = Series(['one','two',np.nan,'four','five','six',np.nan])
serr

0     one
1     two
2     NaN
3    four
4    five
5     six
6     NaN
dtype: object

In [9]:
serr.isnull() #search null values

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

serr.dropna()

In [10]:
serr.dropna() #drop null values

0     one
1     two
3    four
4    five
5     six
dtype: object

In [11]:
dataf = DataFrame([[1,2,3],[np.nan,4,5],[np.nan,np.nan,np.nan]])
dataf

     0    1    2
0  1.0  2.0  3.0
1  NaN  4.0  5.0
2  NaN  NaN  NaN

In [12]:
clean = dataf.dropna()
clean

     0    1    2
0  1.0  2.0  3.0

In [13]:
dataf.dropna(how='all') #drop rows with all null values (how is a method)

     0    1    2
0  1.0  2.0  3.0
1  NaN  4.0  5.0

In [15]:
dataf.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [17]:
npn = np.nan
dataf2 = DataFrame([[1,2,npn],[3,7,0],[npn,npn,8]])
dataf2

     0    1    2
0  1.0  2.0  NaN
1  3.0  7.0  0.0
2  NaN  NaN  8.0

In [35]:
dataf2.dropna(thresh=2) #drop rows with at least n non null values (Require that many non-NA values.)

     0    1    2
0  1.0  2.0  NaN
1  3.0  7.0  0.0

In [37]:
dataf2.fillna(9)

     0    1    2
0  1.0  2.0  9.0
1  3.0  7.0  0.0
2  9.0  9.0  8.0

In [39]:
dataf2.fillna({0:1,1:9,2:99}) #fill any null value in column 0 with 1, in column 1 with 9 .....

     0    1     2
0  1.0  2.0  99.0
1  3.0  7.0   0.0
2  1.0  9.0   8.0

In [40]:
dataf2

     0    1    2
0  1.0  2.0  NaN
1  3.0  7.0  0.0
2  NaN  NaN  8.0

In [41]:
dataf2.fillna(99,inplace=True) #replace the permenent dataf2

In [42]:
dataf2

      0     1     2
0   1.0   2.0  99.0
1   3.0   7.0   0.0
2  99.0  99.0   8.0